console.warn('Задание 1------------------------');
// 1. Дана строка 'aaa@bbb@ccc'. Замените все @ на ! с помощью глобального
// поиска и замены.

console.log('aaa@bbb@ccc'.replace(/@/g, '!'));


console.warn('Задание 2------------------------');
// 2. В переменной date лежит дата в формате 2025-12-31. Преобразуйте эту
// дату в формат 31/12/2025.

let date = new Date('2025-12-31');

let opt = {

    year: 'numeric',
    month: 'numeric',
    day: 'numeric'
}

let dateRe = date.toLocaleString('en', opt).toString().replace(/(.{4})\-(.{2})\-(.{2})/, '$3/$2/$1');
console.log(dateRe); 

console.warn('Задание 3------------------------');
// 3. Дана строка «Я учу javascript!». Вырежете из нее слово «учу» и слово
// «javascript» тремя разными способами (через substr, substring, slice).

let str3 = 'Я учу javascript!';
console.log(str3.substr(2, 3), str3.substr(5, 11));
console.log(str3.substring(2, 5), str3.substring(5, 16));
console.log(str3.slice(2, 5), str3.slice(5, 16));


console.warn('Задание 4------------------------');
// 4. Дан массив с элементами 4, 2, 5, 19, 13, 0, 10. Найдите квадратный корень
// из суммы кубов его элементов. Для решения воспользуйтесь циклом for.

let arr4 = [4, 2, 5, 19, 13, 0, 10],
    sum = 0;

arr4.forEach(element => {
    sum += Math.pow(element, 3);
});

console.log(Math.sqrt(sum));

console.warn('Задание 4------------------------');
// 5. Даны переменные a и b. Отнимите от a переменную b и результат
// присвойте переменной c. Сделайте так, чтобы в любом случае в переменную
// c записалось положительное значение. Проверьте работу скрипта при a и b,
// равных соответственно 3 и 5, 6 и 1.

const onlyPlus = (a, b) => Math.abs(a - b);

console.log(onlyPlus(3, 5));
console.log(onlyPlus(6, 1));


console.warn('Задание 6------------------------');
// 6. Выведите на экран текущую дату-время в формате 12:59:59 31.12.2014.
// Для решения этой задачи напишите функцию, которая будет добавлять 0
// перед днями и месяцами, которые состоят из одной цифры (из 1.9.2014
// сделает 01.09.2014).

let date5 = new Date();

let opt5 = {

    year: 'numeric',
    month: 'numeric',
    day: 'numeric',
    hour: 'numeric',
    minute: 'numeric',
    second: 'numeric'
}

date5.setDate(1);
console.log(date5.toLocaleString('en', opt5));

const fixDate = (str) => str.match(/(.)\/(.)\/(.+), (.):(.):(.) PM/g, "aa");

console.log(fixDate(date5.toDateString()));


console.warn('Задание 7------------------------');
// 7. Дана строка 'aa aba abba abbba abca abea'. Напишите регулярку, которая
// найдет строки aba, abba, abbba по шаблону: буква 'a', буква 'b' любое
// количество раз, буква 'a'.

console.log('aa aba abba abbba abca abea'.match(/ab+a/g));

console.warn('Задание 8------------------------');
// 8. Напишите ф-цию строгой проверки ввода номер телефона в
// международном формате (<код страны>( <код города или сети> <номер
// телефона>). Функция должна возвращать true или false. Используйте
// регулярные выражения.

const phoneTest = (str) => ((/\D/g.exec(str) == null) && (str.match(/\d/g).length < 13) && (str.match(/\d/g).length > 10));

console.log(phoneTest('3752555022'));


console.warn('Классное задание 1------------------------');
// 1. Дан массив . Написать рекурсивную функцию, которая выводит элементы массива в обратном порядке.


const reverseArr = (arr, i = arr.length) => {
    i--;
    console.log(arr[i]);
    
    if(i > 0){

        reverseArr(arr, i);       
    }
}

reverseArr([1, 2, 3, 4, 5]);

// 2. Сделайте функцию inArray, которая определяет, есть в массиве элемент с заданным значением или нет. Функция первым параметром должна принимать значение элемента, а вторым - массив, в котором делается поиск. Функция должна возвращать true или false. Нельзя пользоваться методами indexOf (или lastIndexOf), циклами for или while.




// 3. Перепишите код, заменив цикл for на метод map:

// let arr = ["Есть", "жизнь", "на", "Марсе"];

// const arrLength = [];
// for (let i = 0; i < arr.length; i++) {
// 	arrLength.push(arr[i].length);
// }

// console.log(arrLength); // 4,5,2,5


// 4. Есть 2 массива: arr1 = [1,2,3,4,5,6,7,8] и arr2 = [5, 3, 6, 9, 11]. Напишите функцию, которая принимает 2 массива и возвращает массив элементов, которые есть в обоих массивах. Решите задачу задачу двумя способами: используя оператор расширения; используя цикл.


// 5. Напишите функцию copyArr(arr), которая копирует массив не изменяя оригинал. Скопируйте массив vegetables в новый, и добавьте в него любой элемент.

// const vegetables = ['Капуста', 'Репа', 'Редиска', 'Морковка'];

// Решите задачу задачу двумя способами: используя оператор расширения; используя цикл.


// 6. Есть массив arr = [0, true, false, true, 1, true, true, false, "true", undefined, "1", null]. Необходимо написать функцию, которая вернет количество true (boolean) элементов.


// 7. Напишите функцию createArr(), которая создает массив, заполняемый "руками" (например, через prompt()), пока пользователь не введет пустую строку. Функция должна вернуть созданный массив.


// 8. Напишите функцию numProducts(num),  которая в зависимости от переданного в нее целочисленного аргумента num, будет выводить слово «товар» в нужной форме («12 товаров», но «22 товара»). По умолчанию аргумент num должен иметь значение 0.


// 9. Создайте функцию "Калькулятор", calc(expression), которая должны уметь вычислять операции: сложение, вычитание, умножение, разность; между положительными целочисленными значениями. Математическое выражение должно передаваться через параметр expression в виде строки, например: "45+8", "4-23". Если параметр не передается, то нужно запросить выражение через promp. Результат вычисления выведите через alert. Используйте регулярные выражения для "парсинг" (обработки) параметра).


// 10. Напиши функцию, которая будет проверять любой объем текста на вхождение плохих (запрещенных) слов, и возвращать новый, прошедший цензуру, текст. Запрещенные слова нужно заменить на символы "#" в зависимости от длины слова. В функцию нужно передавать два параметра: текст, массив запрещенных слов.